In [ ]:
from google.colab import files
files.upload()

{}

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("titanic dataset.csv")

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
y=df['Survived']

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df.shape

(891, 12)

In [ ]:
df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)

In [ ]:
df.drop(['Survived'],axis=1,inplace=True)

In [ ]:
df.shape

(891, 7)

In [ ]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [ ]:
df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode()[0])

In [ ]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
df

     Pclass     Sex        Age  SibSp  Parch     Fare Embarked
0         3    male  22.000000      1      0   7.2500        S
1         1  female  38.000000      1      0  71.2833        C
2         3  female  26.000000      0      0   7.9250        S
3         1  female  35.000000      1      0  53.1000        S
4         3    male  35.000000      0      0   8.0500        S
..      ...     ...        ...    ...    ...      ...      ...
886       2    male  27.000000      0      0  13.0000        S
887       1  female  19.000000      0      0  30.0000        S
888       3  female  29.699118      1      2  23.4500        S
889       1    male  26.000000      0      0  30.0000        C
890       3    male  32.000000      0      0   7.7500        Q

[891 rows x 7 columns]

In [ ]:
from sklearn.preprocessing import LabelEncoder,MinMaxScaler

In [ ]:
le=LabelEncoder()
mms=MinMaxScaler()

In [ ]:
df['Sex']=le.fit_transform(df['Sex'])
df['Embarked1']=le.fit_transform(df['Embarked'])

In [ ]:
df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Embraked  Embarked1
0       3    1  22.0      1      0   7.2500         2         2          2
1       1    0  38.0      1      0  71.2833         0         0          0
2       3    0  26.0      0      0   7.9250         2         2          2
3       1    0  35.0      1      0  53.1000         2         2          2
4       3    1  35.0      0      0   8.0500         2         2          2

In [ ]:
df.drop(['Embarked'],axis=1,inplace=True)

In [ ]:
df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embraked  Embarked1
0       3    1  22.0      1      0   7.2500         2          2
1       1    0  38.0      1      0  71.2833         0          0
2       3    0  26.0      0      0   7.9250         2          2
3       1    0  35.0      1      0  53.1000         2          2
4       3    1  35.0      0      0   8.0500         2          2

In [ ]:
df.drop(['Embarked1'],axis=1,inplace=True)

In [ ]:
df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embraked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [ ]:
df['Age']=mms.fit_transform(df[['Age']])
df['Fare']=mms.fit_transform(df[['Fare']])

In [ ]:
df.head()

   Pclass  Sex       Age  SibSp  Parch      Fare  Embraked
0       3    1  0.271174      1      0  0.014151         2
1       1    0  0.472229      1      0  0.139136         0
2       3    0  0.321438      0      0  0.015469         2
3       1    0  0.434531      1      0  0.103644         2
4       3    1  0.434531      0      0  0.015713         2

In [ ]:
x=df.values

In [ ]:
x

array([[3.        , 1.        , 0.27117366, ..., 0.        , 0.01415106,
        2.        ],
       [1.        , 0.        , 0.4722292 , ..., 0.        , 0.13913574,
        0.        ],
       [3.        , 0.        , 0.32143755, ..., 0.        , 0.01546857,
        2.        ],
       ...,
       [3.        , 0.        , 0.36792055, ..., 2.        , 0.04577135,
        2.        ],
       [1.        , 1.        , 0.32143755, ..., 0.        , 0.0585561 ,
        0.        ],
       [3.        , 1.        , 0.39683338, ..., 0.        , 0.01512699,
        1.        ]])

In [ ]:
from sklearn.model_selection import train_test_split as split

In [ ]:
xtr,xte,ytr,yte=split(x,y,test_size=0.2,random_state=0)

In [ ]:
from sklearn.metrics import accuracy_score

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
lr=LogisticRegression()

In [ ]:
lr.fit(xtr,ytr)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
y_pred=lr.predict(xte)

In [ ]:
accuracy=accuracy_score(yte,y_pred)

In [ ]:
print("Accuracy in predicting survival in titanic disaster is ",accuracy*100)

Accuracy in predicting survival in titanic disaster is  79.88826815642457

In [ ]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
dtc=DecisionTreeClassifier()

In [ ]:
dtc.fit(xtr,ytr)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
dt_pred=dtc.predict(xte)

In [ ]:
accuracy_dtree=accuracy_score(yte,dt_pred)

In [ ]:
print("Accuracy in predicting survival in titanic disaster is ",accuracy_dtree*100)

Accuracy in predicting survival in titanic disaster is  77.6536312849162

In [ ]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
rfc=RandomForestClassifier()

In [ ]:
rfc.fit(xtr,ytr)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [ ]:
rfc_pred=rfc.predict(xte)

In [ ]:
accuracy_rfc=accuracy_score(yte,rfc_pred)

In [ ]:
accuracy_rfc*100

83.24022346368714